Revit 2016 API
TaskDialogShowingEventArgs Properties
The TaskDialogShowingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
DialogId
 String ID associated with the task dialog.
HelpId
 An ID that represents the dialog that has been displayed.
 (Inherited from DialogBoxShowingEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Message
 The message that has been displayed in the dialog box.
See Also
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace